Revit 2024 API
BuiltInFailures.CopyPasteFailures.ElementRenamedOnPaste Property
 The loaded type "[Name]" has been renamed to "[New Name]" to avoid conflicts with the existing type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementRenamedOnPaste { get; }
Visual Basic
Public Shared ReadOnly Property ElementRenamedOnPaste As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementRenamedOnPaste {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace